YCSB output txt files/test10000C/jdbc_workloadc_10000_run_240420.txt
Adding shard node URL: jdbc:mysql://localhost:3306/Benchtest
Using shards: 1, batchSize:-1, fetchSize: -1
[OVERALL], RunTime(ms), 4258
[OVERALL], Throughput(ops/sec), 2348.5204321277597
[TOTAL_GCS_PS_Scavenge], Count, 4
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 29
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.6810709253170503
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 4
[TOTAL_GC_TIME], Time(ms), 29
[TOTAL_GC_TIME_%], Time(%), 0.6810709253170503
[READ], Operations, 10000
[READ], AverageLatency(us), 342.0625
[READ], MinLatency(us), 157
[READ], MaxLatency(us), 244223
[READ], 95thPercentileLatency(us), 497
[READ], 99thPercentileLatency(us), 1341
[READ], Return=OK, 10000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 3185.0
[CLEANUP], MinLatency(us), 3184
[CLEANUP], MaxLatency(us), 3185
[CLEANUP], 95thPercentileLatency(us), 3185
[CLEANUP], 99thPercentileLatency(us), 3185